"""
Модуль для роботи з формами відновлення доступу.

Цей модуль містить Django-форму, яка використовуються для скидання паролів.
"""

from django import forms


class PasswordResetForm(forms.Form):
    """
    Форма для запиту на скидання пароля користувача.

    Використовується для збору Email-адреси користувача, на яку
    буде надіслано посилання для відновлення доступу до акаунту.

    Attributes:
        email (EmailField): Електронна пошта користувача. Максимальна
            довжина — 254 символи. Обов'язкове поле.
    """

    email = forms.EmailField(max_length=254)
