"""
Модуль абстрактних міксинів для роботи з URL-ідентифікаторами моделей.

Містить класи, які уніфікують логіку використання людинозрозумілих шляхів (slug)
в різних сутностях системи.
"""

from django.db import models


class SlugMixin(models.Model):
    """
    Абстрактна модель-міксин для додавання поля 'slug' до моделей.
    """

    slug = models.SlugField(max_length=256, verbose_name="Слаг")

    class Meta:
        """Мета-параметри, що визначають клас як абстрактний міксин."""

        abstract = True
